[
    {
        "parable": "The Sower",
        "description": "A sower went out to sow, and as he sowed, some seed fell by the wayside, some on stony places, some among thorns, and others on good ground.",
        "revelation": "The Word of God being received differently according to the heart's condition.",
        "reference": "Matthew 13:3-9"
    },
    {
        "parable": "The Prodigal Son",
        "description": "A younger son wastes his inheritance in a far country, but returns home to be welcomed by his father with a feast.",
        "revelation": "God's boundless mercy and joy over a repentant sinner.",
        "reference": "Luke 15:11-32"
    },
    {
        "parable": "The Good Samaritan",
        "description": "A man is beaten and left for dead; a priest and a Levite pass him by, but a Samaritan stops to show mercy.",
        "revelation": "The call to love our neighbors without prejudice or limitation.",
        "reference": "Luke 10:25-37"
    },
    {
        "parable": "The Pearl of Great Price",
        "description": "A merchant seeks fine pearls and finds one of such immense value that he sells everything he has to buy it.",
        "revelation": "The supreme value of the Kingdom of Heaven requiring total commitment.",
        "reference": "Matthew 13:45-46"
    },
    {
        "parable": "The Unforgiving Servant",
        "description": "A king forgives a servant a massive debt, but that servant then refuses to forgive a fellow servant a small debt.",
        "revelation": "Our obligation to forgive others just as God has forgiven us.",
        "reference": "Matthew 18:21-35"
    },
    {
        "parable": "The Lost Sheep",
        "description": "A shepherd leaves his ninety-nine sheep to go into the wilderness and find the one that is lost.",
        "revelation": "God's personal pursuit of every individual who wanders away.",
        "reference": "Luke 15:3-7"
    },
    {
        "parable": "The House on the Rock",
        "description": "A wise man builds his house on the rock, while a foolish man builds on the sand. The storm comes and only the house on the rock stands.",
        "revelation": "The importance of not just hearing but doing the Word of God for a solid spiritual foundation.",
        "reference": "Matthew 7:24-27"
    },
    {
        "parable": "The Mustard Seed",
        "description": "The Kingdom of Heaven is like a mustard seed, which is the smallest of all seeds but grows into the largest of garden plants.",
        "revelation": "The immense, pervasive growth of God's Kingdom from humble, small beginnings.",
        "reference": "Matthew 13:31-32"
    },
    {
        "parable": "The Ten Virgins",
        "description": "Ten virgins took their lamps to meet the bridegroom; five were wise and brought extra oil, and five were foolish and brought none.",
        "revelation": "The necessity of spiritual preparedness and vigilance for the return of Christ.",
        "reference": "Matthew 25:1-13"
    },
    {
        "parable": "The Talents",
        "description": "A master entrusts his servants with talents; two invest and double them, while one hides his talent in the earth.",
        "revelation": "Our responsibility to faithfully use the gifts and resources God has entrusted to us.",
        "reference": "Matthew 25:14-30"
    },
    {
        "parable": "The Hidden Treasure",
        "description": "A man finds a treasure hidden in a field and, out of joy, sells everything he owns to buy that field.",
        "revelation": "The overwhelming joy and worth of finding the Kingdom of God.",
        "reference": "Matthew 13:44"
    },
    {
        "parable": "The Pharisee and the Publican",
        "description": "A Pharisee prays with pride while a tax collector prays for mercy. Jesus declares the tax collector justified.",
        "revelation": "The value of humble repentance over self-righteous pride in the eyes of God.",
        "reference": "Luke 18:9-14"
    },
    {
        "parable": "The Rich Fool",
        "description": "A man builds bigger barns to store his wealth but dies that night, leaving everything behind.",
        "revelation": "The vanity of accumulating earthly riches without being 'rich toward God'.",
        "reference": "Luke 12:16-21"
    },
    {
        "parable": "The Workers in the Vineyard",
        "description": "A landowner hires workers at different times of the day but pays them all the same daily wage.",
        "revelation": "God's sovereign grace and generosity which is not based on human merit or seniority.",
        "reference": "Matthew 20:1-16"
    },
    {
        "parable": "The Great Banquet",
        "description": "A man prepares a great feast and invites many, but they all make excuses. He then invites the poor and the outcasts.",
        "revelation": "The invitation to the Kingdom of God is open to all, but those who reject it lose their place.",
        "reference": "Luke 14:15-24"
    },
    {
        "parable": "The Persistent Widow",
        "description": "A widow repeatedly asks an unjust judge for justice until he finally grants it to be rid of her.",
        "revelation": "The power of persistent, faithful prayer and God's willingness to answer his children.",
        "reference": "Luke 18:1-8"
    }
]